Repository: 161275/hldig
Catalog: po/*.po
Languages: nl

source: -a Use alternate work files. Tells hldig to append .work to database files, causing a second copy of the database to be built. This allows the original files to be used by htsearch during the indexing run.
nl: -a Gebruik alternatieve werkbestanden. Zorgt dat htdig .work aan de naam van database bestanden toevoegt zodat een tweede kopie van de database word gemaakt. dit zorgt er voor dat je de originele bestanden kunt doorzoeken terwijl de indexeringstaak werkt.

source: -c configfile Use the specified configuration file instead of the default.
nl: -c configuratiebestand Gebruik het opgegeven configuratie bestand in plaats van de standaard.

source: -h hop count Limit the stored documents to those which are at most hopcount links away from the start URL.
nl: -h aantal stappen Limiteer het aantal opgeslagen documenten tot het aantal dat een maximaal aantal stappen verwijderd is van de start URL.

source: -i Initial. Do not use any old databases. This is accomplished by first erasing the databases.
nl: -i Initieel. Gebruik geen oude databases. Dit word bereikt door eerst de oude database te verwijderen.

source: -m minimalfile (or just a file name at end of arguments) Tells hldig to read URLs from the supplied file and index them in place of (or in addition to) the existing URLs in the database and the start_url. With the -m, only the URLs specified are added to the database. A file name of '-' indicates the standard input.
nl: -m minimaalbestand (of enkel een bestandsnaam an het einde van de argumenten) Zorgt er voor dat hldig URLs leest van het opgegeven bestand en indexeert ze in plaats van (of in aanvulling op) de bestaande URLs in de database en de start_url. Met het -m attribuut, worden enkel de URLs opgegeven in het bestand aan de database toegevoegd. Een bestandsnaam van 't' geeft aan dat de standaard invoer gebruikt dient te worden.

source: -s Report statistics after completion.
nl: -s Toon statistieken na voltooien.

source: -t Create an ASCII version of the document database. This database is easy to parse with other programs so that information can be extracted from it.
nl: -t Maak een ASCII versie van de documenten database. Deze database is makkelijk te verwerken voor andere programma's zodat zij hier informatie uit kunnen halen.

source: -u username:password Tells hldig to send the supplied username and password with each HTTP request. The credentials will be encoded using the 'Basic' authentication scheme. There *HAS* to be a colon (:) between the username and password.
nl: -u gebruikersnaam:wachtwoord Zorgt er voor dat de opgegeven gebruikersnaam en wachtwoord met elk HTTP verzoek worden verzonden. De gegevens worden verzonden met het 'Basic' schema. Er *MOET* een dubbele punt (:) tussen de gebruikersnaam en het wachtwoord aanwezig zijn.

source: -v Verbose mode. This increases the verbosity of the program. Using more than 2 is probably only useful for debugging purposes. The default verbose mode gives a nice progress report of what it is doing and where it is.
nl: -v Verbale modus. Dit maakt het programma meer verbaal. Een getal hoger dan 2 is waarschijnlijk enkel handig bij het debuggen. De standaard verbale modus geeft een mooi voortgangsrapport van wat er gedaan wordt en waar zich dit bevind.

source: query_string A CGI-style query string can be given as a single argument, and is only used if the REQUEST_METHOD environment variable is not set. If no query_string is given, and REQUEST_METHOD is not set, hlsearch will prompt for the query.
nl: query_string Een CGI-stijl query string kan worden opgegeven als een enkel argument, en wordt enkel gebruikt indien de REQUEST_METHOD omgeving variable niet is opgegeven. Indien er geen query_string is gegeven, en REQUEST_METHOD niet is opgegeven, zal hlsearch er om vragen.

source: is no longer supported
nl: is niet langer ondersteund

source: Importing Cookies input file
nl: Importeren van Cookies bestand

source: Invalid url_part_aliases or common_url_parts: %s
nl: Onjuiste url_part_aliases of common_url_parts: %s

source: Invalid url_rewrite_rules: %s
nl: Onjuiste url_rewrite_rules: %s

source: Options:
nl: Opties:

source: Unable to find configuration file '%s'
nl: Kan configuratie bestand niet vinden '%s'

source: Unable to load cookies file '%s' in memory
nl: Kan cookies bestand '%s' niet in het geheugen laden

source: Warning: Configuration option
nl: Waarschuwing: Configuratie optie

source: Warning: Import failed! (
nl: Waarschuwing: Importeren mislukt! (

source: Warning: unknown locale!
nl: Waarschuwing: onbekende locale!

source: authorization
nl: authorizatie

source: hldig End Time:
nl: hldig Eind Tijd:

source: hldig Start Time:
nl: hldig Start Tijd:

source: usage: hldig [-v][-i][-c configfile][-t][-m minimalfile] This program is part of hldig %s Options:
nl: gebruik: hldig [-v][-i][-c configuratiebestand][-t][-m minimaalbestand] Dit programma maakt deel uit van hl://Dig %s Opties:

source: usage: hlsearch [-v][-d][-c configfile] [query_string] This program is part of hl://Dig %s
nl: gebruik: hlsearch [-v][-d][-c configuratiebestand] [query_string] Dit programma maakt deel uit van hl://Dig %s

source: usage: htdump [-v][-d][-w][-a][-c configfile] This program is part of hl://Dig %s
nl: gebruik: htdump [-v][-d][-w][-a][-c configuratiebestand] Dit programma maakt deel uit van hl://Dig %s
